Reports/ЭкспрессПроверкаУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ЭкспрессПроверкаУчета</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/ПоступлениеТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровИУслуг</Name>
			<Comment>Поступление товаров и услуг</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ОтгрузкиСПроизодстваДляРозницы</xr:Item>
				<xr:Item>AccumulationRegister.Закупки</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРозницыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ПоступленияДляРозницыОтПроизодства</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеЗаказовРозницы</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРозницыВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресМонтажа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРозничногоДоговора</Name>
					<Comment>#7381</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОтПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОтПроизводстваПоРучнымЗаказам</Name>
					<Comment>#7381</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОтПроизводстваУИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРаспределенияСтоимостиДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ЭкспрессПроверкаУчета/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;
&НаКлиенте
Перем ФормаДлительнойОперации;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодОтчета = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод);
	
	ПроверкиПоУмолчаниюНаСервере();	
	
	УправлениеВидимостьюНаСервере();
	ОбновитьЭлементыФормыНаСервере();
	// №9396 Элементы.ДекорацияВсегоФайлов.Заголовок = "Всего файлов в базе: " + Строка(ПолучитьКоличествоФайловНаСервере());
	
	УстановитьВидимостьГруппыДатыЗапрета();
	
	ЗапускатьПриОткрытии = Параметры.ЗапускатьПриОткрытии;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗапускатьПриОткрытии Тогда
		ВыполнитьПроверку(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормыНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Проведен
	|	И НЕ(ЧАС(ПоступлениеТоваровИУслуг.Дата) = 0
	|				И МИНУТА(ПоступлениеТоваровИУслуг.Дата) = 0
	|				И СЕКУНДА(ПоступлениеТоваровИУслуг.Дата) = 1)";
	Элементы.ПеренестиВсеПоступленияНаНачалоДня.Заголовок = "Перенести все поступления товаров на начало дня (" + Запрос.Выполнить().Выбрать().Количество() + ")";
	                           
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОприходованиеТоваров.Ссылка
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|ГДЕ
	|	ОприходованиеТоваров.Проведен
	|	И НЕ(ЧАС(ОприходованиеТоваров.Дата) = 0
	|				И МИНУТА(ОприходованиеТоваров.Дата) = 0
	|				И СЕКУНДА(ОприходованиеТоваров.Дата) = 1)";
	Элементы.ПеренестиВсеОприходованияТоваровНаНачалоДня.Заголовок = "Перенести все оприходования товаров на начало дня (" + Запрос.Выполнить().Выбрать().Количество() + ")";
	
	ОбновитьСостояниеПоследовательностиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеПоследовательностиНаСервере()
	
	РезультатПроверки = ОбщийМодульСервер.ОбновитьЭлементыФормыПоследовательностьСебестоимости(ЭтотОбъект, Ложь); //Истина);
	Элементы.ГруппаСебестоимость.Заголовок = "Себестоимость" + ?(РезультатПроверки, " (!)", "");

	//Если ОбщийМодуль.ПоследовательностьПоСебестоимостиНарушена() Тогда
	//	 
	//	УстановитьПривилегированныйРежим(Истина);
	//	ТекстОшибкиВосстановления = РегламентныеЗаданияСлужебный.СообщенияИОписанияОшибокРегламентногоЗадания(РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиПоСебестоимостиТоваров));
	//	
	//	Элементы.ГруппаПоследовательность.Видимость = Истина;
	//	Элементы.ДекорацияНарушенаПоследовательность.Заголовок = 
	//	"Для корректного расчёта себестоимости все документы должны проводиться строго в хронологическом порядке." + Символы.ПС 
	//	+ "В базе имеются документы которые были проведены или изменены задним числом, что привело к нарушению хронологии последовательности." + Символы.ПС 
	//	+ "Последний документ до которого себестоимость посчитана правильно: " + Символы.ПС + ОбщийМодуль.ПолучитьГраницуПоследовательностиПоСебестоимости() + Символы.ПС 
	//	+ "Для перепроведения документов в хронологическом порядке (для пересчета себестоимости) нажмите на кнопку ""Восстановить""."+ Символы.ПС 
	//	+ "Если система не сможет какой-то документ провести автоматически, восстановление последовательности будет остановлено." + Символы.ПС 
	//	+ "Необходимо такой документ исправить и провести вручную и повторно запустить восстановление последовательности."
	//	+ Символы.ПС 
	//	+ Символы.ПС
	//	+ ?(ПустаяСтрока(ТекстОшибкиВосстановления),"", "Ошибка, полученная в результате последнего автоматического запуска восстановления последовательности: " + ТекстОшибкиВосстановления);
	//	
	//	Элементы.ДекорацияПоследовательностьВПорядке.Видимость = Ложь;
	//	Элементы.ГруппаСебестоимость.Заголовок = "Себестоимость (!)";
	//	
	//Иначе
	//	Элементы.ГруппаПоследовательность.Видимость = Ложь;
	//	Элементы.ДекорацияПоследовательностьВПорядке.Видимость = Истина;
	//	Элементы.ГруппаСебестоимость.Заголовок = "Себестоимость";
	//КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью(ВариантОтображения = 1)
	
	Если ВариантОтображения = 2 Тогда
		Элементы.ГруппаСтраницОтчет.ТекущаяСтраница = Элементы.ГруппаИсправлениеОбъектов;
	Иначе
		Элементы.ГруппаСтраницОтчет.ТекущаяСтраница = Элементы.ГруппаРезультат;
	КонецЕсли;
						   
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюНаСервере(ВариантОтображения = 1)
	
	Если ВариантОтображения = 2 Тогда
		Элементы.ГруппаСтраницОтчет.ТекущаяСтраница = Элементы.ГруппаИсправлениеОбъектов;
	Иначе
		Элементы.ГруппаСтраницОтчет.ТекущаяСтраница = Элементы.ГруппаРезультат;
	КонецЕсли;
	
	// #9916
	Элементы.ПроверкаСоответствияПоступленийРеализацийПоИнтеркампани.Видимость = Константы.ИспользоватьИнтеркампани.Получить();
						   
КонецПроцедуры

&НаКлиенте
Процедура ВидПроверкиПриИзменении(Элемент)
	УправлениеВидимостьюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//============================================== ИНТЕРФЕЙСНЫЕ ПРОЦЕДУРЫ ========================================
&НаКлиенте
Процедура Пауза(КоличествоСекунд)
	
	ВС_Шелл = Новый COMОбъект("WScript.Shell");
	ВС_Шелл.Run("ping 127.0.0.1 -n "+КоличествоСекунд, 0, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияПрерыванияИсправления()
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно)
	
	Если РезультатОбработки Тогда
		КоличествоОбъектовУспешно = КоличествоОбъектовУспешно + 1;
	Иначе
		КоличествоОбъектовНеуспешно = КоличествоОбъектовНеуспешно + 1;
	КонецЕсли;
	
	ШрифтСообщения = Новый Шрифт(,,Истина);
	ЦветСообщения = WebЦвета.Черный;
	ЦветУспешногоОбъекта = WebЦвета.ЗеленыйЛес;
	ЦветПроблемногоОбъекта = WebЦвета.Красный;
	
	ФормСтрока1 = Новый ФорматированнаяСтрока("Всего объектов к обработке: " + Строка(КоличествоОбъектов) + ", ", ШрифтСообщения, ЦветСообщения);  
	ФормСтрока2 = Новый ФорматированнаяСтрока("обработано успешно: " + Строка(КоличествоОбъектовУспешно) + ", ", ШрифтСообщения, ЦветУспешногоОбъекта);
	ФормСтрока3 = Новый ФорматированнаяСтрока("неуспешно: " + Строка(КоличествоОбъектовНеуспешно), ШрифтСообщения, ЦветПроблемногоОбъекта);

	МассивСтрокСообщения = Новый Массив;
	МассивСтрокСообщения.Добавить(ФормСтрока1);
	МассивСтрокСообщения.Добавить(ФормСтрока2);
	МассивСтрокСообщения.Добавить(ФормСтрока3);
	
	ИнформацияПоОбработкеОбъектов = Новый ФорматированнаяСтрока(МассивСтрокСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если Расшифровка = "ПоставитьДатуВыпускаПозжеДатыЗаказаНаПроизводство" Тогда		
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
	
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_ВыпускПродукцииРаньшеЗаказаНаПроизводство(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ПоставитьДатуРеализацииПозжеДатыЗаказаНаПроизводство" Тогда	
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_РеализацияРаньшеЗаказаНаПроизводство(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ПоставитьДатуРеализацииПозжеДатыЗаказаПокупателя" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
	
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_РеализацияРаньшеЗаказаПокупателя(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ПоставитьДатуПоступленияРаньшеДатыРеализации" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
	    ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_РеализацияРаньшеПоступления(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ПоставитьДатуЗаказаПоставщикуРаньшеДатыПоступления" Тогда		
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
	
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_ПоступлениеРаньшеЗаказаПоставщику(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);		
		
	ИначеЕсли Расшифровка = "ПоставитьДатуРеализацииПозжеДатыЗНПпоЗД" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
	
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_РеализацияРаньшеЗНПпоЗД(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ПоставитьДатуРеализацииПозжеДатыВыпускаПоЗНП" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_РеализацияРаньшеВыпускаПоЗНП(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);

	ИначеЕсли Расшифровка = "ЗапуститьОбработчикПроведенияДокументовПослеОбновления" Тогда
		СтандартнаяОбработка = Ложь;		
		ОткрытьФормуМодально("Обработка.НастройкаПрограммы.Форма.ОбработкаДокументовПослеОбновления");
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ОбновитьУслугиВыпускаПоЗаказуНаПроизводство" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_ОбновитьУслугиВыпускаПоЗаказуНаПроизводство(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ПометитьНаУдалениеНепроведенныеДокументы" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_ПометитьНаУдалениеНепроведенныеДокументы(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли ТипЗнч(Расшифровка) =	Тип("СписокЗначений") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Расшифровка.Количество() > 0 Тогда
			
			Если ТипЗнч(Расшифровка[0].Значение) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
				
				НазваниеФормы = "Документ.РеализацияТоваровИУслуг.ФормаСписка";
				
			ИначеЕсли ТипЗнч(Расшифровка[0].Значение) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда			
				НазваниеФормы = "Документ.ЗаказПокупателя.ФормаСписка";
				
			ИначеЕсли ТипЗнч(Расшифровка[0].Значение) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда				
				НазваниеФормы = "Документ.ЗаказНаПроизводство.ФормаСписка";
				
			ИначеЕсли ТипЗнч(Расшифровка[0].Значение) = Тип("ДокументСсылка.ВыпускПродукции") Тогда				
				НазваниеФормы = "Документ.ВыпускПродукции.ФормаСписка";
				
			ИначеЕсли ТипЗнч(Расшифровка[0].Значение) = Тип("СправочникСсылка.Номенклатура") Тогда				
				НазваниеФормы = "Справочник.Номенклатура.ФормаСписка";
				
			Иначе
				Возврат;
			КонецЕсли;	
			
			ПараметрыФормы = ПолучитьНастройкиОткрытияСписка(Расшифровка);
			ОткрытьФорму(НазваниеФормы, новый Структура("ФиксированныеНастройки", ПараметрыФормы), ЭтотОбъект);
			
		КонецЕсли;
		
	ИначеЕсли Расшифровка = "ЗаполнитьЗначениеЗаказаВТабличныхЧастяхРеализации" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъект_ЗаполнитьЗначениеЗаказаВТабличныхЧастяхРеализации(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ИсправитьОтрицательныеОстаткиТоваров" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_ОтрицательныеОстаткиТоваров(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "ИсправитьОтрицательныеОстаткиДС" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_ОтрицательныеОстаткиДС(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "КорректировкаИспользованияОстатковПленки" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_КорректировкаИспользованияОстатковПленкиМатериалаЗаказчика(Расшифровка);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	ИначеЕсли Расшифровка = "КорректировкаИспользованияматериалаЗаказчика" Тогда
		СтандартнаяОбработка = Ложь;
		УправлениеВидимостью(2);
		
		ПодключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления", 0.1, Истина);
		ИсправитьОбъекты_КорректировкаИспользованияОстатковПленкиМатериалаЗаказчика(Расшифровка, Ложь);
		ОтключитьОбработчикОжидания("ОбработкаОжиданияПрерыванияИсправления");
		
		УправлениеВидимостью();
		ВыполнитьПроверку(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОткрытияСписка(СписокДокументов)

	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;	

	Элт = КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элт.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	Элт.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Элт.Использование = Истина;
	Элт.ПравоеЗначение = СписокДокументов;

	Возврат КомпоновщикНастроек.ФиксированныеНастройки

КонецФункции

&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");

	//ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
    ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
    ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
    ОтображениеСостояния.Текст                          = НСтр("ru = 'Данные формируются...'");
	
	РезультатВыполнения = ВыполнитьПроверкуНаСервере();
		
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда  
		
		ОбработатьРезультат(АдресХранилища);

		ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
		ОтображениеСостояния.Видимость                      = Ложь;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
		ОтображениеСостояния.Картинка                       = Новый Картинка;
		ОтображениеСостояния.Текст                          = "";
		
	Иначе
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);    
	КонецЕсли;
 	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверкуНаСервере()
	
	ОбщийМодульСервер.ОтметитьЗапускОтчетаЭкспрессПроверки();
	
	Результат.Очистить();
	ОбъектыКИсправлению.Очистить();

	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);    
	ИдентификаторЗадания = Неопределено;
	
	//СтруктураПараметров = Новый Структура;    
	//СтруктураПараметров.Вставить("Отчет", РеквизитФормыВЗначение("Отчет")); 
	//СтруктураПараметров.Вставить("Результат", Результат);
	СтруктураПараметров = Новый Соответствие;
	СтруктураПараметров.Вставить("ДатаНачала",    ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания", ПериодОтчета.ДатаОкончания);
	СтруктураПараметров.Вставить("ПроверкаРазныеПодразделенияЗаказНаПроизводствоИВыпускПродукции", ПроверкаРазныеПодразделенияЗаказНаПроизводствоИВыпускПродукции);
	СтруктураПараметров.Вставить("ПроверкаВыпускПродукцииРаньшеЗаказаНаПроизводство", ПроверкаВыпускПродукцииРаньшеЗаказаНаПроизводство);
	СтруктураПараметров.Вставить("ПроверкаРеализацияРаньшеЗаказаПокупателя", ПроверкаРеализацияРаньшеЗаказаПокупателя);
	СтруктураПараметров.Вставить("ПроверкаРеализацияРаньшеПоступления", ПроверкаРеализацияРаньшеПоступления);
	СтруктураПараметров.Вставить("ПроверкаПоступлениеРаньшеЗаказаПоставщику", ПроверкаПоступлениеРаньшеЗаказаПоставщику);
	СтруктураПараметров.Вставить("ПроверкаСуммаРеализацииНеСходитсяССуммойЗаказаПокупателя", ПроверкаСуммаРеализацииНеСходитсяССуммойЗаказаПокупателя);
	СтруктураПараметров.Вставить("ПроверкаОтрицательныеОстатки", ПроверкаОтрицательныеОстатки);
	СтруктураПараметров.Вставить("ПроверкаОтрицательныеОстаткиДенежныеСредства", ПроверкаОтрицательныеОстаткиДенежныеСредства);
	СтруктураПараметров.Вставить("ПроверкаДокументыКОбработкеПослеОбновления", ПроверкаДокументыКОбработкеПослеОбновления);
	СтруктураПараметров.Вставить("ПроверкаДокументыНеПроведенныеНеПомеченныеНаУдаление", ПроверкаДокументыНеПроведенныеНеПомеченныеНаУдаление);
	СтруктураПараметров.Вставить("ПроверкаДокументыИСправочникиПомеченныеНаУдаление", ПроверкаДокументыИСправочникиПомеченныеНаУдаление);
	СтруктураПараметров.Вставить("ПроверкаДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя", ПроверкаДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя);
	СтруктураПараметров.Вставить("ПроверкаПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя", ПроверкаПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя);
	СтруктураПараметров.Вставить("ПроверкаЗаказовНаПроизводствоВНедействительныхСтатусах", ПроверкаЗаказовНаПроизводствоВНедействительныхСтатусах);
	СтруктураПараметров.Вставить("ПроверкаСостоянияОтгрузкиПоВыполненнымЗаказамПокупателей", ПроверкаСостоянияОтгрузкиПоВыполненнымЗаказамПокупателей);
	СтруктураПараметров.Вставить("ПроверкаСоответствияПродукцииВыпускаИЗаказаНаПроизводство", ПроверкаСоответствияПродукцииВыпускаИЗаказаНаПроизводство);
	СтруктураПараметров.Вставить("ПроверкаСоответствияУслугВыпускаИЗаказаНаПроизводство", ПроверкаСоответствияУслугВыпускаИЗаказаНаПроизводство);
	СтруктураПараметров.Вставить("ПроверкаУникальныйПотолокБолееЧемВОдномДокументе", ПроверкаУникальныйПотолокБолееЧемВОдномДокументе);
	СтруктураПараметров.Вставить("ПроверкаЗаказыНаПроизводствоВРеализации", ПроверкаЗаказыНаПроизводствоВРеализации);
	СтруктураПараметров.Вставить("ПроверкаЗаполнениеЗаказовВТабличныхЧастяхРеализаций", ПроверкаЗаполнениеЗаказовВТабличныхЧастяхРеализаций);
	СтруктураПараметров.Вставить("ПроверкаНомерРасчетаВДокументеНеСоответствуетНомеруРасчетаВыпускаемойПРодукции", ПроверкаНомерРасчетаВДокументеНеСоответствуетНомеруРасчетаВыпускаемойПРодукции);
	СтруктураПараметров.Вставить("ПроверкаКоличестваПотолков", ПроверкаКоличестваПотолков);	
	СтруктураПараметров.Вставить("ПроверкаРасходятсяКоличествоКВыработкеМатериаловВыпускаПродукции", ПроверкаРасходятсяКоличествоКВыработкеМатериаловВыпускаПродукции);	
	СтруктураПараметров.Вставить("ПроверкаКорректностьИспользованияОстатковПленки", ПроверкаКорректностьИспользованияОстатковПленки);
	СтруктураПараметров.Вставить("ПроверкаКорректностьИспользованияМатериалаЗаказчика", ПроверкаКорректностьИспользованияМатериалаЗаказчика);
	//#9777
	СтруктураПараметров.Вставить("ПроверкаЗакрытыеЗаказыСозданныеБезИспользованияСтатусаЗакрыт", ПроверкаЗакрытыеЗаказыСозданныеБезИспользованияСтатусаЗакрыт);
	//#9916
	СтруктураПараметров.Вставить("ПроверкаСоответствияПоступленийРеализацийПоИнтеркампани", ПроверкаСоответствияПоступленийРеализацийПоИнтеркампани);
	СтруктураПараметров.Вставить("ПроверкаНеуникальностьНомераРасчетаПоНоменклатуре", ПроверкаНеуникальностьНомераРасчетаПоНоменклатуре); // №13851
	//++17197
	СтруктураПараметров.Вставить("ПроверкаКонтрольРезервов", ПроверкаКонтрольРезервов);	
	//--17197
		
	//СтруктураПараметров.Вставить("", );
	
	//Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
	//	
	//	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	//	// здесь должен быть вызов нашей процедуры
	//	МодульОтчетов.СформироватьОтчетЭкспрессПроверкаУчета(СтруктураПараметров, АдресХранилища);
	//	РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	//	
	//Иначе
		
		РезультатВыполнения  = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
		"МодульОтчетов.СформироватьОтчетЭкспрессПроверкаУчета", 
		СтруктураПараметров, 
		"Экспресс проверка учета");    
		
		ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
		АдресХранилища       = РезультатВыполнения.АдресХранилища;    
		
	//КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
			//РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
			//ОбработатьРезультат(РезультатВыполнения);
			ОбработатьРезультат(АдресХранилища);
			
			//ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);		
			ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
			ОтображениеСостояния.Видимость                      = Ложь;
            ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
            ОтображениеСостояния.Картинка                       = Новый Картинка;
            ОтображениеСостояния.Текст                          = "";
		
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
		КонецЕсли;
	Исключение        
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)    
     Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);    
 КонецФункции
 
 &НаСервере
Процедура ОбработатьРезультат(РезультатВыполнения)
	//Результат.Вывести(РезультатВыполнения.ТабличныйДокумент); 
	РезультатВыполнения = ПолучитьИзВременногоХранилища(РезультатВыполнения);	
	Результат = РезультатВыполнения.ТабличныйДокумент;
	Для каждого ЭлементРез из РезультатВыполнения.ОбъектыКИсправлению Цикл
		НоваяСтрока = ОбъектыКИсправлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементРез);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкаДатыЗапретаНажатие(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИзмененияДатыЗапрета", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.ДатыЗапретаИзменения.Форма.ДатыЗапретаИзменения",,,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияДатыЗапрета(Результат, ДополнительныеПараметры) Экспорт
	УстановитьВидимостьГруппыДатыЗапрета();	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппыДатыЗапрета()
	
	ЕстьЗапрет = ОбщийМодульСервер.ЕстьЗапретИзмененияДанных(Дата(2001,1,1));
	Элементы.ГруппаДатаЗапрета.Видимость = ЕстьЗапрет; 

КонецПроцедуры

&НаСервере
Процедура ВыделитьПроверки(Выделить)
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);

	Для каждого РеквизитФормы из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если РеквизитФормы.ТипЗначения = ДопустимыеТипы И СтрНачинаетсяС(РеквизитФормы.Имя, "Проверка") Тогда
			ЭтаФорма[РеквизитФормы.Имя] = Выделить;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПроверки(Команда)
	ВыделитьПроверки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеПроверки(Команда)	
	ВыделитьПроверки(Истина);	
КонецПроцедуры

&НаСервере
Процедура ПроверкиПоУмолчаниюНаСервере()
	ВыделитьПроверки(Истина);
	ПроверкаДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя = Ложь;
	ПроверкаПотолокУказанныйВЗаказеНаПроизводствоОтсутствуетВЗаказеПокупателя = Ложь;
	ПроверкаСостоянияОтгрузкиПоВыполненнымЗаказамПокупателей = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкиПоУмолчанию(Команда)
	ПроверкиПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиИсправлений

//============================================== ПРОЦЕДУРЫ ПО ВИДАМ ПРОВЕРОК ========================================
//============================================== Дата документа выпуска меньше чем дата заказа на производство ===============================================
&НаКлиенте
Процедура ИсправитьОбъекты_ВыпускПродукцииРаньшеЗаказаНаПроизводство(Исправить)
		
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление даты выпусков продукции";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_ВыпускПродукцииРаньшеЗаказаНаПроизводство(ТекущаяСтрока.Документ1, ТекущаяСтрока.Документ2);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_ВыпускПродукцииРаньшеЗаказаНаПроизводство(ДокументВыпускПродукции, ДокументЗаказНаПроизводство)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_ВыпускПродукцииРаньшеЗаказаНаПроизводство(ДокументВыпускПродукции, ДокументЗаказНаПроизводство);
КонецФункции

//============================================== Дата реализации товаров и услуг меньше чем дата заказа на производство ========================================
&НаКлиенте
Процедура ИсправитьОбъекты_РеализацияРаньшеЗаказаНаПроизводство(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление даты реализации";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_РеализацияРаньшеЗаказаНаПроизводство(ТекущаяСтрока.Документ1, ТекущаяСтрока.Документ2);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_РеализацияРаньшеЗаказаНаПроизводство(ДокументРеализация, ДокументЗаказНаПроизводство)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_РеализацияРаньшеЗаказаНаПроизводство(ДокументРеализация, ДокументЗаказНаПроизводство);	
КонецФункции

//================================ Дата реализации товаров и услуг меньше чем дата заказа на производство (случай подчинения докментов заказу покупателя) =======
&НаКлиенте
Процедура ИсправитьОбъекты_РеализацияРаньшеЗНПпоЗД(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление даты заказа на производства и выпуска продукции";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_РеализацияРаньшеЗНПпоЗД(ТекущаяСтрока.Документ1, ТекущаяСтрока.Документ2);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_РеализацияРаньшеЗНПпоЗД(ДокументРеализация, ДокументЗНП)
	РезультатОбработки = Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_РеализацияРаньшеЗНПпоЗД(ДокументРеализация, ДокументЗНП);	
	//Результат2 = Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъектВыпускПродукцииПоЗНП(ДокументЗНП); // вызывается в ИсправитьОбъект_РеализацияРаньшеЗНПпоЗД	
	Возврат РезультатОбработки;
КонецФункции

//================================ Дата реализации товаров и услуг меньше чем дата выпуска (случай подчинения документов одному ЗНП) =======
&НаКлиенте
Процедура ИсправитьОбъекты_РеализацияРаньшеВыпускаПоЗНП(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();

	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление даты реализации и выпуска продукции";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_РеализацияРаньшеВыпускаПоЗНП(ТекущаяСтрока.Документ1, ТекущаяСтрока.Документ2);	
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_РеализацияРаньшеВыпускаПоЗНП(ДокументРеализация, ДокументВыпуска)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_РеализацияРаньшеВыпускаПоЗНП(ДокументРеализация, ДокументВыпуска)
КонецФункции

//============================================== Дата реализации товаров и услуг меньше чем дата заказа покупателя ========================================
&НаКлиенте
Процедура ИсправитьОбъекты_РеализацияРаньшеЗаказаПокупателя(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление даты реализации";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_РеализацияРаньшеЗаказаПокупателя(ТекущаяСтрока.Документ1, ТекущаяСтрока.Документ2);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_РеализацияРаньшеЗаказаПокупателя(ДокументРеализация, ДокументЗаказПокупателя)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_РеализацияРаньшеЗаказаПокупателя(ДокументРеализация, ДокументЗаказПокупателя)	
КонецФункции

//============================================== Дата реализации товаров и услуг меньше чем дата поступления ========================================
&НаКлиенте
Процедура ИсправитьОбъекты_РеализацияРаньшеПоступления(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление даты поступления";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_РеализацияРаньшеПоступления(ТекущаяСтрока.Документ1, ТекущаяСтрока.Документ2);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_РеализацияРаньшеПоступления(ДокументРеализация, ДокументПоступления)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_РеализацияРаньшеПоступления(ДокументРеализация, ДокументПоступления);
КонецФункции

//============================================== Дата поступления товаров и услуг меньше чем дата заказа поставщику ========================================
&НаКлиенте
Процедура ИсправитьОбъекты_ПоступлениеРаньшеЗаказаПоставщику(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление даты заказа поставщику";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_ПоступлениеРаньшеЗаказаПоставщику(ТекущаяСтрока.Документ1, ТекущаяСтрока.Документ2);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_ПоступлениеРаньшеЗаказаПоставщику(ДокументПоступления, ДокументЗаказПоставщику)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_ПоступлениеРаньшеЗаказаПоставщику(ДокументПоступления, ДокументЗаказПоставщику);	
КонецФункции

//================================ ДанныеПоПотолкуЗаказаНаПроизводствоНеСходятсяСДаннымиЗаказаПокупателя =======
&НаКлиенте
Процедура ИсправитьОбъекты_ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	//КоличествоОбъектов = СтрокиКОбработке.Количество();
	//КоличествоОбъектовУспешно = 0;
	//КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление соответствия заказа на производство по потолку заказу покупателя";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		ДоступноИзменениеПриНаличииВыпуска = ТекущаяСтрока.ПараметрБулево;
		ИсправитьОбъект_ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(ТекущаяСтрока.Документ1, ТекущаяСтрока.Документ2, ДоступноИзменениеПриНаличииВыпуска);
		
		//ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ИсправитьОбъект_ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(Знач ДокументЗНП, Знач ДокументЗП, Знач ДоступноИзменениеПриНаличииВыпуска)
	Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_ОбновитьЗаказНаПроизводствоПоПотолкуПоЗаказуПокупателя(ДокументЗНП, ДокументЗП, ДоступноИзменениеПриНаличииВыпуска);
КонецПроцедуры

//================================ ОбновитьУслугиВыпускаПоЗаказуНаПроизводство =======

&НаКлиенте
Процедура ИсправитьОбъекты_ОбновитьУслугиВыпускаПоЗаказуНаПроизводство(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление соответствия услуг выпуска и заказа на производство";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_ОбновитьУслугиВыпускаПоЗаказуНаПроизводство(ТекущаяСтрока.Документ1, ТекущаяСтрока.Документ2);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_ОбновитьУслугиВыпускаПоЗаказуНаПроизводство(ДокументВыпуск, ДокументЗНП)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_ОбновитьУслугиВыпускаПоЗаказуНаПроизводство(ДокументВыпуск, ДокументЗНП);
КонецФункции

//============================================== ЗаполнитьЗаказВТабличнойЧастиРеализации =========================================
&НаКлиенте
Процедура ИсправитьОбъект_ЗаполнитьЗначениеЗаказаВТабличныхЧастяхРеализации(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Заполнение значения ""Заказ"" в табличных частях ""Товары"" и ""Услуги"" документа реализации, если заказ не заполнен, но реализация полностью соответствует заказу";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_ЗаполнитьЗначениеЗаказаВТабличныхЧастяхРеализацииНаСервере(ТекущаяСтрока.Документ1);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_ЗаполнитьЗначениеЗаказаВТабличныхЧастяхРеализацииНаСервере(ДокументРеализация)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_ЗаполнитьЗначениеЗаказаВТабличныхЧастяхРеализации(ДокументРеализация);
КонецФункции

//============================================== ИсправитьОтрицательныеОстаткиТоваров =========================================
&НаКлиенте
Процедура ИсправитьОбъекты_ОтрицательныеОстаткиТоваров(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление отрицательных остатков по товарам";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_ОтрицательныеОстаткиТоваровНаСервере(ТекущаяСтрока.Документ1);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_ОтрицательныеОстаткиТоваровНаСервере(ДокументРасхода)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_ОтрицательныеОстаткиТоваров(ДокументРасхода);
КонецФункции

//============================================== ИсправитьОтрицательныеОстаткиДС =========================================
&НаКлиенте
Процедура ИсправитьОбъекты_ОтрицательныеОстаткиДС(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Исправление отрицательных остатков по денежным средствам";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_ОтрицательныеОстаткиДСНаСервере(ТекущаяСтрока.Документ1);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_ОтрицательныеОстаткиДСНаСервере(ДокументРасхода)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_ОтрицательныеОстаткиДС(ДокументРасхода);
КонецФункции
//============================================== ИсправитьОбъект_КорректировкаИспользованияОстатковПленки =========================================
&НаКлиенте
Процедура ИсправитьОбъекты_КорректировкаИспользованияОстатковПленкиМатериалаЗаказчика(Исправить, ЭтоОстаток = Истина)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();
	
	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Корректировка использования остатков пленки";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_КорректировкаИспользованияОстатковПленкиМатериалаЗаказчика(ТекущаяСтрока.Документ1, ЭтоОстаток);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_КорректировкаИспользованияОстатковПленкиМатериалаЗаказчика(ДокументВыпуска, ЭтоОстаток = Истина)
	РезультатОбработки = Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_КорректировкаИспользованияОстатковПленкиМатериалаЗаказчика(ДокументВыпуска, ЭтоОстаток);
	Возврат РезультатОбработки.Успешно;
КонецФункции

//============================================== ПометитьНаУдаление непроведенные документы ========================================
&НаКлиенте
Процедура ИсправитьОбъекты_ПометитьНаУдалениеНепроведенныеДокументы(Исправить)
	
	Отбор = Новый Структура("Исправить", Исправить);
	СтрокиКОбработке = ОбъектыКИсправлению.НайтиСтроки(Отбор);
	
	КоличествоВыполнено = 0;
	Элементы.КоличествоВыполнено.МаксимальноеЗначение = СтрокиКОбработке.Количество();

	КоличествоОбъектов = СтрокиКОбработке.Количество();
	КоличествоОбъектовУспешно = 0;
	КоличествоОбъектовНеуспешно = 0;
	
	ТекущееСостояниеВыполнения = "Пометка на удаление непроведенных документов";
	ОбновитьОтображениеДанных();
	
	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл
		ОбработкаПрерыванияПользователя();
		РезультатОбработки = ИсправитьОбъект_ПометитьНаУдалениеНепроведенныеДокументы(ТекущаяСтрока.Документ1);
		
		ОбновитьНадписьИнформацииПоОбработкеОбъектов(РезультатОбработки, КоличествоОбъектов, КоличествоОбъектовУспешно, КоличествоОбъектовНеуспешно);
		КоличествоВыполнено = КоличествоВыполнено + 1;
		ОбновитьОтображениеДанных();
		Пауза(1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИсправитьОбъект_ПометитьНаУдалениеНепроведенныеДокументы(ДокументСсылка)
	Возврат Отчеты.ЭкспрессПроверкаУчета.ИсправитьОбъект_ДокументыНеПроведенныеНеПомеченныеНаУдаление(ДокументСсылка);	
КонецФункции

#КонецОбласти

#Область ВкладкаОбработки
//============================================== Сервисные обработки ========================================
&НаСервере
Процедура ПеренестиВсеПоступленияНаНачалоДняНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровИУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Проведен
	|	И НЕ(ЧАС(ПоступлениеТоваровИУслуг.Дата) = 0
	|				И МИНУТА(ПоступлениеТоваровИУслуг.Дата) = 0
	|				И СЕКУНДА(ПоступлениеТоваровИУслуг.Дата) = 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.Дата = НачалоДня(ДокОбъект.Дата) + 1;
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Ошибка проведения " + Выборка.Ссылка + ". " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВсеПоступленияНаНачалоДня(Команда)
	ПеренестиВсеПоступленияНаНачалоДняНаСервере();
	ПоказатьПредупреждение(,"Готово");
	ОбновитьЭлементыФормыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПеренестиВсеОприходованияТоваровНаНачалоДняНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОприходованиеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|ГДЕ
	|	ОприходованиеТоваров.Проведен
	|	И НЕ(ЧАС(ОприходованиеТоваров.Дата) = 0
	|				И МИНУТА(ОприходованиеТоваров.Дата) = 0
	|				И СЕКУНДА(ОприходованиеТоваров.Дата) = 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.Дата = НачалоДня(ДокОбъект.Дата) + 1;
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Ошибка проведения " + Выборка.Ссылка + ". " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВсеОприходованияТоваровНаНачалоДня(Команда)
	ПеренестиВсеОприходованияТоваровНаНачалоДняНаСервере();
	ПоказатьПредупреждение(,"Готово");
	ОбновитьЭлементыФормыНаСервере();
КонецПроцедуры

#КонецОбласти

//++ №9396 функционал перенесен в отдельную обработку "АрхивацияПрикрепленныхДанных" 
#Область ВкладкаПрикрепленныеДанные
//============================================== Прикрепленные данные ========================================
//&НаСервере
//Функция ПолучитьКоличествоФайловНаСервере()
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	КОЛИЧЕСТВО(*) КАК Количество
//	|ИЗ
//	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные";
//	
//	Запрос.УстановитьПараметр("ИспользоватьДатаНачала", НачалоДатаФайла <> Дата(1, 1, 1));
//	Запрос.УстановитьПараметр("ИспользоватьДатаКонца", 	КонецДатаФайла<> Дата(1, 1, 1));
//	Запрос.УстановитьПараметр("ДатаНачала", 			НачалоДня(НачалоДатаФайла));
//	Запрос.УстановитьПараметр("ДатаКонца", 				КонецДня(КонецДатаФайла));
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.Количество;
//	КонецЕсли;
//	Возврат 0;
//КонецФункции

//&НаСервере
//Процедура ПолучитьДанныеНаСервере()
//	Файлы.Очистить();
//	ФайлыКОбработке.Очистить();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ПрикрепленныеДанные.Период,
//	|	ПрикрепленныеДанные.ИмяФайла,
//	|	ПрикрепленныеДанные.ВидФайлаПрограммыПостроителя,
//	|	ПрикрепленныеДанные.СсылкаНаОбъект
//	|ИЗ
//	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
//	|ГДЕ
//	|	ВЫБОР
//	|			КОГДА &ИспользоватьДатаНачала
//	|				ТОГДА ПрикрепленныеДанные.Период >= &ДатаНачала
//	|			ИНАЧЕ ИСТИНА
//	|		КОНЕЦ
//	|	И ВЫБОР
//	|			КОГДА &ИспользоватьДатаКонца
//	|				ТОГДА ПрикрепленныеДанные.Период <= &ДатаКонца
//	|			ИНАЧЕ ИСТИНА
//	|		КОНЕЦ";
//	
//	Запрос.УстановитьПараметр("ИспользоватьДатаНачала", НачалоДатаФайла <> Дата(1, 1, 1));
//	Запрос.УстановитьПараметр("ИспользоватьДатаКонца", 	КонецДатаФайла<> Дата(1, 1, 1));
//	Запрос.УстановитьПараметр("ДатаНачала", 			НачалоДня(НачалоДатаФайла));
//	Запрос.УстановитьПараметр("ДатаКонца", 				КонецДня(КонецДатаФайла));
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		НоваяСтрока = ФайлыКОбработке.Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//	КонецЦикла;
//	Элементы.Индикатор.МаксимальноеЗначение = Выборка.Количество();
//КонецПроцедуры

//&НаСервере
//Процедура ПолучитьРазмерФайла(СтруктураПоиска)
//	
//	МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
//	МенеджерЗаписи.Период						= СтруктураПоиска.Период;
//	МенеджерЗаписи.ВидФайлаПрограммыПостроителя = СтруктураПоиска.ВидФайлаПрограммыПостроителя;
//	МенеджерЗаписи.СсылкаНаОбъект 				= СтруктураПоиска.СсылкаНаОбъект;
//	МенеджерЗаписи.ИмяФайла 					= СтруктураПоиска.ИмяФайла;						

//	Попытка
//		МенеджерЗаписи.Прочитать();
//		РазмерФайла = МенеджерЗаписи.Данные.Получить().Размер()/1024;
//		Если (ИспользоватьОтборПоРазмеру И РазмерФайла > РазмерБолее)
//			ИЛИ НЕ ИспользоватьОтборПоРазмеру Тогда
//			НовыйФайл = Файлы.Добавить();
//			ЗаполнитьЗначенияСвойств(НовыйФайл, МенеджерЗаписи);
//			НовыйФайл.Пометка = Истина;
//			НовыйФайл.Размер = РазмерФайла;	
//			
//			КоличествоПолученныхФайлов = КоличествоПолученныхФайлов + 1;
//		КонецЕсли;
//	Исключение
//	КонецПопытки;

//КонецПроцедуры

//&НаКлиенте
//Процедура ПолучитьДанные(Команда)	
//	КоличествоПолученныхФайлов = 0;
//	Индикатор = 0;
//	Элементы.Индикатор.Видимость = Истина;
//	ПолучитьДанныеНаСервере();
//	
//	Для Каждого ЭлементТаблицы Из ФайлыКОбработке Цикл
//		ОбработкаПрерыванияПользователя();
//		
//		СтруктураДанных = Новый Структура;
//		СтруктураДанных.Вставить("Период", ЭлементТаблицы.Период);
//		СтруктураДанных.Вставить("ВидФайлаПрограммыПостроителя", ЭлементТаблицы.ВидФайлаПрограммыПостроителя);
//		СтруктураДанных.Вставить("СсылкаНаОбъект", ЭлементТаблицы.СсылкаНаОбъект);
//		СтруктураДанных.Вставить("ИмяФайла", ЭлементТаблицы.ИмяФайла);
//		ПолучитьРазмерФайла(СтруктураДанных);
//		
//		Индикатор = Индикатор + 1;
//		ОбновитьОтображениеДанных();
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОтметитьВсеФайлы(Команда)
//	Для каждого ЭлементТаблицы из Файлы Цикл
//		ЭлементТаблицы.Пометка = Истина;
//	КонецЦикла;
//КонецПроцедуры

//&НаКлиенте
//Процедура СнятьОтметкуВсеФайлы(Команда)
//	Для каждого ЭлементТаблицы из Файлы Цикл
//		ЭлементТаблицы.Пометка = Ложь;
//	КонецЦикла;
//КонецПроцедуры

//&НаСервере
//Процедура УдалитьФайлыНаСервере()
//	Для каждого ЭлементТаблицы из Файлы Цикл
//		Если ЭлементТаблицы.Пометка Тогда
//			МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
//			МенеджерЗаписи.Период						= ЭлементТаблицы.Период;
//			МенеджерЗаписи.ВидФайлаПрограммыПостроителя = ЭлементТаблицы.ВидФайлаПрограммыПостроителя;
//			МенеджерЗаписи.СсылкаНаОбъект 				= ЭлементТаблицы.СсылкаНаОбъект;
//			МенеджерЗаписи.ИмяФайла 					= ЭлементТаблицы.ИмяФайла;						
//			Попытка
//				МенеджерЗаписи.Прочитать();
//				МенеджерЗаписи.Удалить();
//			Исключение
//				Сообщить(ОписаниеОшибки());
//			КонецПопытки;
//		КонецЕсли;	
//	КонецЦикла;
//	
//	Элементы.ДекорацияВсегоФайлов.Заголовок = "Всего файлов в базе: " + Строка(ПолучитьКоличествоФайловНаСервере());
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УдалитьФайлыКоманда(Команда)
//	УдалитьФайлыНаСервере();
//КонецПроцедуры

//&НаКлиенте
//Процедура РазмерБолееПриИзменении(Элемент) 
//	ИспользоватьОтборПоРазмеру = РазмерБолее > 0;
//КонецПроцедуры

//&НаКлиенте
//Процедура ПолучитьДанныеБезРазмера(Команда)
//	КоличествоПолученныхФайлов = 0;
//	Индикатор = 0;
//	Элементы.Индикатор.Видимость = Истина;
//	ПолучитьДанныеНаСервере();
//	
//	Для Каждого ЭлементТаблицы Из ФайлыКОбработке Цикл
//		ОбработкаПрерыванияПользователя();
//		
//		НовыйФайл = Файлы.Добавить();
//		ЗаполнитьЗначенияСвойств(НовыйФайл, ЭлементТаблицы);
//		НовыйФайл.Пометка = Истина;	
//			
//		КоличествоПолученныхФайлов = КоличествоПолученныхФайлов + 1;
//		
//		Индикатор = Индикатор + 1;
//		ОбновитьОтображениеДанных();
//	КонецЦикла;
//КонецПроцедуры

#КонецОбласти

#Область ВкладкаСебестоимость

&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗапускеВосстановленияПоследовательности", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Восстановление последовательности может занять продолжительное время, программа в этот момент будет вас не доступна для работы. Продолжить?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиОбновлениеСостоянияПоследовательностиПриИзменении(Элемент)
	
	ОтключитьОбработчикОжидания("ОбработчикОбновленияСостоянияПоследовательности");
	Если АвтоматическиОбновлениеСостоянияПоследовательности Тогда
		ПодключитьОбработчикОжидания("ОбработчикОбновленияСостоянияПоследовательности", 1);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗапускеВосстановленияПоследовательности(Результат, Параметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
		
	Если ОбщийМодуль.ПоследовательностьПоСебестоимостиНарушена() Тогда
		Сообщение = "";
		Идентификатор = "";
		
		ОбщийМодуль.ЗапуститьФоновоеЗаданиеВосстановлениеПоследовательностиПоСебестоимости(Сообщение, Идентификатор);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			ИдентификаторФоновогоЗадания = Идентификатор;			
			ПодключитьОбработчикОжидания("СообщитьОбОкончанииВосстановленияПоследовательности", 0.1, Истина);
		КонецЕсли;
		
		ПоказатьПредупреждение(, Сообщение);
		
		ОтключитьОбработчикОжидания("ОбработчикОбновленияСостоянияПоследовательности");
		Если АвтоматическиОбновлениеСостоянияПоследовательности Тогда
			ПодключитьОбработчикОжидания("ОбработчикОбновленияСостоянияПоследовательности", 1);	
		КонецЕсли;
		
	КонецЕсли;	
	ОбновитьЭлементыФормыНаСервере();
		
КонецПроцедуры
	
&НаКлиенте
Процедура СообщитьОбОкончанииВосстановленияПоследовательности()
	
	ОповещенияОбОкончанииВыполнения = ОбщийМодуль.ОповещенияОбОкончанииВыполненияРегламентныхЗаданий(ИдентификаторФоновогоЗадания);
	
	Если ТипЗнч(ОповещенияОбОкончанииВыполнения) = Тип("Структура") Тогда
		
		ПоказатьОповещениеПользователя(
			"Выполнена процедура восстановления последовательности",
			, "Восстановление последовательности завершено в фоновом задании " + Строка(ОповещенияОбОкончанииВыполнения.МоментОкончания)
			+ ?(ЗначениеЗаполнено(ОповещенияОбОкончанииВыполнения.ОписаниеОшибки), Символы.ПС + "Завершено с ошибками: " + ОповещенияОбОкончанииВыполнения.ОписаниеОшибки, ""),				
			БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		
		ПодключитьОбработчикОжидания(
			"СообщитьОбОкончанииВосстановленияПоследовательности", 2, Истина);	
		
	Иначе	
		ОбновитьЭлементыФормыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновленияСостоянияПоследовательности()
	ОбновитьСостояниеПоследовательностиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеПоследовательности(Команда)
	ОбновитьСостояниеПоследовательностиНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВосстановление(Команда)	
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда		
		ОтменитьВосстановлениеНаСервере(ИдентификаторФоновогоЗадания);
		ИдентификаторФоновогоЗадания = "";
			
		ПоказатьПредупреждение(,
				НСтр("ru = 'Задание отменено, но состояние отмены будет
				|установлено сервером только через секунды,
				|возможно потребуется обновить данные вручную.'"));
	Иначе
		ПоказатьОповещениеПользователя("Восстановление не запущено");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОтменитьВосстановлениеНаСервере(Знач ИдентификаторФЗ)
	
	РегламентныеЗаданияСлужебный.ОтменитьФоновоеЗадание(ИдентификаторФЗ);
		
КонецПроцедуры

#КонецОбласти
